[
    {
        "id": "1",
        "order": "3",
        "name": "Mohamed Taman",
        "bio": "Systems Architect & design supervisor, Adopts, JCP, JCP Executive Committee member, JSR 358, 354, 364, & 363 EG, MoroccoJUG member, EGJUG leader, Oracle Egypt Architects Club board member, speaks java, love mobile, international speaker. Won Duke’s choice 2014 awards, and JCP adopt 2013 awards.",
        "country": "Egypt",
        "company": "E-Finance",
        "type": "speaker",
        "contacts": {
            "twitter": "_tamanm",
            "blog": "http://about.me/mohamedtaman"
        }
    },
    {
        "id": "2",
        "order": "5",
        "name": "Nick Zeeb",
        "bio": "Nick Zeeb is a senior Java developer at LMAX Exchange.  As a computer science and finance enthusiast he is super excited by the merger of the two in the form of cryptocurrency. He's worked as a developer at a hedge fund, investment bank and currently at a financial exchange.",
        "country": "UK",
        "company": "LMAX Exchange",
        "type": "speaker",
        "contacts": {
            "twitter": "@NickZeeb",
            "blog": "http://nickzeeb.wordpress.com/"
        }
    },
    {
        "id": "3",
        "order": 2,
        "name": "Gleb Smirnov",
        "bio": "Dealing with stability-critical high-performance applications, including, but not limited to financial systems, for a number of years. A fierce practitioner of TDD. Actively promoting Mutation Analysis and raising general JVM internals awareness via articles and talks. Currently employed at Plumbr, Estonia.",
        "country": "Estonia",
        "company": "Plumbr",
        "type": "speaker",
        "contacts": {
            "twitter": "@gvsmirnov",
            "blog": "http://lanyrd.com/profile/gvsmirnov/"
        }
    },
    {
        "id": "4",
        "order": 4,
        "name": "Michał Tajchert",
        "bio": "In short words: mobile dev. with big interests in wearables devices - done programming for platforms such: Google Glass, Sony SW2, Oakley Airwave, Android Wear.",
        "country": "Poland",
        "company": "Polidea",
        "type": "speaker",
        "contacts": {
            "twitter": "tajchert",
            "blog": "http://tajchert.pl/"
        }
    },
    {
        "id": "5",
        "order": 1,
        "name": "Mark Rittman",
        "bio": "Mark Rittman is an expert Oracle Business Intelligence consultant, trainer and developer, and has worked for over ten years with tools such as Oracle Warehouse Builder, Oracle Discoverer, Oracle Database, Oracle BI Suite Enterprise Edition / Siebel Analytics, Oracle Application Server and Oracle OLAP. Mark is an Oracle ACE, an Oracle Fusion Middleware Regional Director, is regularly published on Oracle Technology Network an in Oracle Magazine, chairs user groups in the UK and USA, and consults for organizations around the world on design, best practices and implementation of Oracle’s BI & data warehousing tools.",
        "country": "UK",
        "company": "Rittman Mead",
        "type": "speaker",
        "contacts": {
            "twitter": "markrittman",
            "blog": "http://rittmanmead.com/"
        }
    },
    {
        "id": "6",
        "order": 6,
        "name": "Heli Helskyaho",
        "bio": "CEO, Miracle Finland Oy. Oracle ACE Director. Ambassador/Spokesperson, EMEA Oracle User groups Community (EOUC). President, Oracle User Group Finland (OUGF).",
        "country": "Finland",
        "company": "Miracle",
        "type": "speaker",
        "contacts": {
            "twitter": "HeliFromFinland",
            "blog": "http://helifromfinland.wordpress.com/"
        }
    },
    {
        "id": "7",
        "order": 7,
        "name": "Samuel Rats",
        "bio": "Software engineer working on Genymotion. Android & System dev. GDG Lyon organizer.",
        "country": "France",
        "company": "Genymobile",
        "type": "speaker",
        "contacts": {
            "twitter": "rsamsam"
        }
    },
    {
        "id": "8",
        "order": 0,
        "name": "Tim Hall",
        "bio": "Tim Hall is an Oracle DBA/Developer and well known Oracle blogger at Oracle-Base. If that isn't enough, he's written two books and over 500 articles, is an Oracle ACE Director, OakTable member and has presented at numerous user groups and conferences worldwide, as well as a series of 2-day presentations as part of the 'Oracle University Celebrity Series'",
        "country": "UK",
        "company": "Oracle-Base",
        "type": "speaker",
        "contacts": {
            "twitter": "oraclebase",
            "blog": "http://www.oracle-base.com/"
        }
    },
    {
        "id": "9",
        "order": -1,
        "name": "David Delabassee",
        "bio": "David is a Java EE Evangelist working for Oracle. Prior to Oracle, David spent a decade at Sun Microsystems focusing on Java end-to-end (from the smart card to the high end server), related technologies and the developer tools. In his various roles, David has been involved in numerous Java projects since the early days of this technology. David lives in Belgium and in his spare time, he enjoys tinkering and playing with technologies such as Java, Arduino, Linux, Home Automation, etc.",
        "country": "Belgium",
        "company": "Oracle",
        "type": "speaker",
        "contacts": {
            "twitter": "delabassee",
            "blog": "http://delabassee.com/"
        }
    },
    {
        "id": "10",
        "order": -2,
        "name": "Shai Almog",
        "bio": "Shai is a 20 year industry vendor and former Sun Microsystem engineer, co-founder of the LWUIT project and member of the original WTK team. Shai has worked with all major operators and manufactures world wide and has partnered with Chen Fishbein to form the open source Codename One project.",
        "country": "Israel",
        "company": "Codename One",
        "type": "speaker",
        "contacts": {
            "twitter": "Codename_One",
            "blog": "http://www.codenameone.com/"
        }
    },
    {
        "id": "11",
        "order": -3,
        "name": "Arun Gupta",
        "bio": "Arun Gupta is Director of Developer Advocacy at Red Hat and focuses on JBoss Middleware. A founding member of the Java EE team at Sun Microsystems, he led a cross-functional team at Oracle to drive the global launch of the Java EE 7 platform through strategy, planning, and execution of content, marketing campaigns, and program. Arun has extensive speaking experience in ~40 countries on myriad topics and is a JavaOne Rockstar. He also founded the Devoxx4Kids chapter in the USA and continues to promoting technology education amongst kids. An author of a best-selling book, an avid runner, a globe trotter, a Java Champion, JUG leader",
        "country": "USA",
        "company": "Red Hat",
        "type": "speaker",
        "contacts": {
            "twitter": "arungupta",
            "blog": "http://blog.arungupta.me/"
        }
    },
    {
        "id": "12",
        "order": -4,
        "name": "Robin Moffatt",
        "bio": "Robin Moffatt is a Principal Consultant and Trainer at Rittman Mead. He specialises in Exalytics and OBIEE, with particular interests in systems architecture, administration, and performance testing and optimisation. He blogs at http://ritt.md/rmoff and can be found tweeting grumpy geek thoughts as @rmoff.",
        "country": "UK",
        "company": "Rittman Mead",
        "type": "speaker",
        "contacts": {
            "twitter": "rmoff",
            "blog": "http://ritt.md/rmoff"
        }
    },
    {
        "id": "14",
        "order": -6,
        "name": "Fernando Cejas",
        "bio": "Software Engineer. Geek. GDG Barcelona Organizer. Agile methodologies, programming and technology fun. Biography: Passionate mobile application developer. Currently working as Android Consultant. He has been involved in android app development since 2010 for several companies. He is also Organizer of the Barcelona Google Developers Group (GDG).",
        "country": "Spain",
        "company": "android10",
        "type": "speaker",
        "contacts": {
            "twitter": "fernando_cejas",
            "blog": "http://fernandocejas.com/"
        }
    },
    {
        "id": "15",
        "order": -7,
        "name": "David Vávra",
        "bio": "Android Dev, Glass Explorer, Android Wear Dev, GDG Prague Organizer, Early Adopter",
        "country": "Czech Republic",
        "company": "Avast Mobile",
        "type": "speaker",
        "contacts": {
            "twitter": "destil",
            "blog": "http://www.destil.cz/"
        }
    },
    {
        "id": "16",
        "order": -8,
        "name": "Jan-Willem Eshuis",
        "bio": "Jan-Willem is a experienced freelance software architect, technical consultant and Amazon Web Services specialist. In the last 15 years he combined technical skills with practical, hands-on business insights for several companies and organisations.",
        "country": "Netherlands",
        "company": "JWE new media solutions",
        "type": "speaker",
        "contacts": {
            "twitter": "jweshuis",
            "blog": "https://jwe.nl/"
        }
    },
    {
        "id": "17",
        "order": -9,
        "name": "Dmitry Chuyko",
        "bio": "Employee of Oracle. Was engaged in development of both mobile and cloud software, in large companies and in startups as well. In the past, an employee of Borland, Yota, QuickOffice and Deutsche Bank.",
        "country": "Russia",
        "company": "Oracle",
        "type": "speaker",
        "contacts": {
        }
    },
    {
        "id": "18",
        "order": -10,
        "name": "Krasimir Tsonev",
        "bio": "Krasimir Tsonev is a front-end developer, blogger and speaker. He loves writing JavaScript and experimenting with the latest CSS and HTML features. Author of the 'Node.js blueprints' book he is focused on delivering cutting edge applications. Krasimir started his career as graphic designer, he spent several years coding in ActionScript3. Right now, with the rise of the mobile development, he is enthusiastic to work on responsive applications targeted to various devices. Living and working in Bulgaria he graduated at the Technical University of Varna with bachelor and master degree in computer science.",
        "country": "Bulgaria",
        "company": "Independent",
        "type": "speaker",
        "contacts": {
            "twitter": "KrasimirTsonev",
            "blog": "http://krasimirtsonev.com/"
        }
    },
    {
        "id": "19",
        "order": -11,
        "name": "Anatoly Ropotov",
        "bio": "Anatoly is CEO of Game Insight, a leading global game company that makes free-to-play mobile and social games with a combined audience of over 250 million players. He's been making games for more than 15 years and has over 100 products to his credit.",
        "country": "Latvia",
        "company": "Game Insight",
        "type": "speaker",
        "contacts": {
            "twitter": "tolik"
        }
    },
    {
        "id": "20",
        "order": -12,
        "name": "James Nugent",
        "bio": "James is a developer and consultant living in Bath, England. He works on the open-source Event Store database and is a connoisseur of cider and old guitars.",
        "country": "UK",
        "company": "Event Store LLP",
        "type": "speaker",
        "contacts": {
            "twitter": "jen20",
            "blog": "http://jen20.com/"
        }
    },
    {
        "id": "21",
        "order": -13,
        "name": "Kai Kreuzer",
        "bio": "Kai Kreuzer is a Java and OSGi expert, a Home Automation enthusiast, founder of openHAB.org, project lead of Eclipse SmartHome and co-lead of the Eclipse IoT top-level project. He works as a Developer Evangelist in the Connected Home department of Deutsche Telekom AG, which develops a smart home platform called QIVICON.",
        "country": "Germany",
        "company": "Deutsche Telekom AG",
        "type": "speaker",
        "contacts": {
            "twitter": "kaikreuzer",
            "blog": "http://kaikreuzer.blogspot.com/"
        }
    },
    {
        "id": "22",
        "order": -14,
        "name": "Henrik Ståhl",
        "bio": "Henrik Stahl is VP of Product Management for Java and Internet of Things for Oracle, responsible for product vision and strategy for these areas. He joined Oracle as part of the BEA Systems acquisition, where he served in a similar capacity for the JRockit family of products, which sums up to over 10 years working with JVM and Java strategy and development. During his time at Oracle, Henrik lead the effort getting the Exalogic engineered system out of the door, and for the past three years he has been driving Internet of Things strategy across Oracle focused on intelligent devices and value from business processes and data analytics. Mr. Stahl holds a Master of Science in Engineering Physics from the Royal Institute of Technology in Sweden. He lives with his family in Sweden and spends his spare time doing random sports, gardening and playing flamenco guitar.",
        "country": "Sweden",
        "company": "Oracle",
        "type": "speaker",
        "contacts": {
            "blog": "blogs.oracle.com/henrik"
        }
    },
    {
        "id": "23",
        "order": -15,
        "name": "Gerrit Grunwald",
        "bio": "Gerrit is a software engineer with more than 10 years of experience in software development. He has been involved in Java desktop application developments and controls development. His current interests include JavaFX, HTML5 and Swing especially development of custom controls in one of these technologies. He is also very interested in Java on embedded devices like Raspberry Pi, BeagleBoneBlack, CubieBoard, Odroid-U3, BananaPi, i.MX6 and others. He is a true believer in open source and has participated in popular projects like JFXtras as well as his own projects (SteelSeries Swing, SteelSeries Canvas, Enzo, FXGConverter). As a Java Champion he is an active member of the Java community, where he founded and lead the Java User Group Münster (Germany), co leads the JavaFX and IoT community.",
        "country": "Germany",
        "company": "Oracle",
        "type": "speaker",
        "contacts": {
            "twitter": "hansolo_",
            "blog": "http://harmoniccode.blogspot.com/"
        }
    },
    {
        "id": "24",
        "order": -16,
        "name": "Roel Hartman",
        "bio": "Roel is a very experienced Oracle Software Architect. He started a long time ago using Oracle RDBMS 5, Oracle Forms 2.3, RPT/RPF and Oracle*Case 4.5. Since a few years he focuses mainly on Oracle Application Express. Roel has been a speaker on UKOUG, OOW, Collaborate, ODTUG's KSCOPE and a number of local Oracle User Groups. He is an active participant of the Oracle APEX Forum and keeps an (APEX-related) blog on http://roelhartman.blogspot.com. In June 2009 Roel received an Oracle ACE award and in August 2010 he's appointed as Oracle ACE Director. Roel is a co-writer of the 'Expert Oracle Application Express' and 'Oracle Application Express for Mobile Web Applications' books. Roel is Director at APEX Consulting in The Netherlands.",
        "country": "Netherlands",
        "company": "APEX Consulting",
        "type": "speaker",
        "contacts": {
            "twitter": "RoelH",
            "blog": "http://roelhartman.blogspot.com"
        }
    },
    {
        "id": "25",
        "order": -17,
        "name": "Andrey Adamovich",
        "bio": "Andrey Adamovich is a software craftsman with many years of experience in different lifecycle phases of software creation. Andrey's love is JVM ecosystem. In recent years, he tries to apply JVM goodness to DevOps initiatives his company is implementing for several clients. He is one of the authors of Groovy 2 Cookbook as well as frequent speaker at local communities and conferences.",
        "country": "Latvia",
        "company": "Aestas IT",
        "type": "speaker",
        "contacts": {
            "twitter": "aestasit"
        }
    },
    {
        "id": "26",
        "order": -18,
        "name": "Ted Neward",
        "bio": "Ted Neward is an industry professional of twenty years' experience. He speaks at conferences all over the world and writes regularly for a variety of publications across the Java, .NET, and other ecosystems. He currently resides in the Pacific Northwest with his wife, two sons, dog, four cats, eight laptops, seven tablets, nine phones, and a rather large utility bill.",
        "country": "USA",
        "company": "Neward & Associates",
        "type": "speaker",
        "contacts": {
            "twitter": "tedneward",
            "blog": "http://blogs.tedneward.com/"
        }
    },
    {
        "id": "27",
        "order": -19,
        "name": "Oleg Anastasyev",
        "bio": "Oleg Anastasyev started his career in computer programming in 1995. He developed banking, telecom software as well as software for the government of Latvia. </br>Oleg is a leading developer at Ok.ru. His primary responsibilities as a Platform Team member are development of architectures and solutions for highly loaded as well as big data services, solving performance and availability problems.",
        "country": "Latvia",
        "company": "Odnoklassniki.ru",
        "type": "speaker",
        "contacts": {
            "twitter": "m0nstermind"
        }
    },
    {
        "id": "28",
        "order": -20,
        "name": "Andrei Pangin",
        "bio": "Andrei Pangin is the lead software engineer at Mail.ru Group since 2011. He develops the platform of OK.RU, the popular social network.</br></br>Previously he worked at Oracle on HotSpot JVM. Andrei's areas of expertise are Java Virtual Machines as well as high-loaded projects in Java.",
        "country": "Russia",
        "company": "Odnoklassniki.ru",
        "type": "speaker",
        "contacts": {
        }
    },
    {
        "id": "29",
        "order": -21,
        "name": "Simon Ritter",
        "bio": "Simon Ritter is a Java Technology Evangelist at Oracle Corporation. Simon has been in the IT business since 1984 and holds a Bachelor of Science degree in Physics from Brunel University in the U.K. Originally working in the area of UNIX development for AT&T UNIX System Labs and then Novell, Simon moved to Sun in 1996. At this time he started working with Java technology and has spent time working both in Java technology development and consultancy. Having moved to Oracle as part of the Sun acquisition he now focuses on the core Java platform, Java for client applications and embedded Java. He also continues to develop demonstrations that push the boundaries of Java for applications like gestural interfaces and embedded robot controllers.",
        "country": "UK",
        "company": "Oracle",
        "type": "speaker",
        "contacts": {
            "twitter": "speakjava",
            "blog": "blogs.oracle.com/speakjava"
        }
    },
    {
        "id": "30",
        "order": -22,
        "name": "Patroklos Papapetrou",
        "bio": "Patroklos Papapetrou is a software architect, addicted to software quality and an agile team leader with more than 15 years of experience in software development. He believes and invests in people and team spirit seeking quality excellence. He's one of the authors of SonarQube in action book and he's currently writing \"The Art of Software Gardening\". He treats software systems as flowers that's why he prefers calling himself a software gardener.",
        "country": "Greece",
        "company": "Oracle",
        "type": "workshoper",
        "contacts": {
            "twitter": "ppapapetrou76",
            "blog": "softwaregarden.io/about-patroklos-papapetrou/"
        }
    },
    {
        "id": "31",
        "order": -23,
        "name": "Richard Warburton",
        "bio": "Richard is an empirical technologist and solver of deep-dive technical problems.  Recently he has been working on data analytics for high performance computing and has written a book on Java 8 Lambdas for O’Reilly.  He is a leader in the London Java Community and organised the Adopt-a-JSR programs for Java 8 and runs the Openjdk Hackdays.  Richard is also a known conference speaker, having talked at JavaOne, JFokus, Devoxx, Geecon and JAX London. Previously he worked on static analysis problems and compilers and has obtained a PhD in Computer Science from The University of Warwick.",
        "country": "UK",
        "company": "Monotonic Ltd",
        "type": "workshoper",
        "contacts": {
            "twitter": "richardwarburto"
        }
    }
]